/**
 * @class
 * @extends Language
 */
class Chinese extends Language
{
    /**
     * @constructor
     * @public
     */
    constructor()
    {
        super();
    }

    /**
     * @return {Map}
     * @method
     * @public
     */
    createMapping ()
    {
        return new Map([
            ["{{プレビューのON/OFF}}", "预览开/关"],
            ["{{フォント枠サイズ}}", "字体框架大小"],
            ["{{フォント枠カラー}}", "字体框架颜色"],
            ["{{オニオンスキン}}", "洋葱皮"],
            ["{{バケツツール}}", "桶式工具"],
            ["{{ペンツール}}", "钢笔工具"],
            ["{{ダブルクリックでカーブポイントが追加されます}}", "双击来添加一个曲线点"],
            ["{{選択ツール}}", "选择工具"],
            ["{{Shape変形ツール}}", "形状转换工具"],
            ["{{テキストツール}}", "文本工具"],
            ["{{短形ツール}}", "矩形工具"],
            ["{{楕円ツール}}", "椭圆工具"],
            ["{{角丸矩形ツール}}", "圆角矩形工具"],
            ["{{塗りのカラー}}", "填充颜色"],
            ["{{線のカラー}}", "笔画颜色"],
            ["{{線の太さ}}", "笔画宽度"],
            ["{{プロジェクトデータの読込}}", "加载项目数据"],
            ["{{プロジェクトデータを保存}}", "保存项目数据"],
            ["{{書き出し}}", "出口"],
            ["{{Discordへ移動}}", "转到discord"],
            ["{{バグ報告}}", "错误报告"],
            ["{{設定}}", "设置"],
            ["{{タブを追加}}", "添加一个标签"],
            ["{{タブの一覧を表示・移動}}", "查看并在标签列表中移动"],
            ["{{スクリプトを追加}}", "添加一个脚本"],
            ["{{キーフレームを追加}}", "添加一个关键帧"],
            ["{{空のキーフレームを追加}}", "添加一个空的关键帧"],
            ["{{フレームを追加}}", "添加一个框架"],
            ["{{フレームを削除}}", "删除框架"],
            ["{{再生}}", "播放"],
            ["{{停止}}", "停止"],
            ["{{ループ設定}}", "循环设置"],
            ["{{レイヤーを追加}}", "添加一个图层"],
            ["{{レイヤーを削除}}", "删除图层"],
            ["{{全てのレイヤーをハイライト}}", "突出显示所有层"],
            ["{{全てのレイヤーを非表示}}", "隐藏所有层"],
            ["{{全てのレイヤーをロック}}", "锁定所有层"],
            ["{{比率を固定}}", "固定比率"],
            ["{{ステージの幅}}", "舞台宽度"],
            ["{{背景色}}", "背景颜色"],
            ["{{ステージの高さ}}", "舞台高度"],
            ["{{フレームレート}}", "帧速率"],
            ["{{シンボル名}}", "符号名称"],
            ["{{イージング設定}}", "缓和设置"],
            ["{{ビデオの音量設定}}", "视频音量设置"],
            ["{{自動再生}}", "自动播放"],
            ["{{テキストエリアのボーダー設定}}", "文本区边框设置"],
            ["{{テキスト入力設定}}", "文本输入设置"],
            ["{{フォント選択}}", "字体选择"],
            ["{{自動サイズ調整}}", "自动调整尺寸"],
            ["{{フォントスタイルタイプ}}", "字体风格类型"],
            ["{{行揃え}}", "对齐设置"],
            ["{{改行設定}}", "换行设置"],
            ["{{スクロール設定}}", "滚动设置"],
            ["{{フォントサイズ}}", "字体大小"],
            ["{{フォントカラー}}", "字体颜色"],
            ["{{行間}}", "线路空间"],
            ["{{文字幅}}", "字符宽度"],
            ["{{左マージン}}", "左边空白处"],
            ["{{右マージン}}", "右边的保证金"],
            ["{{カラー種別の選択}}", "选择一个颜色类型"],
            ["{{背景画像の選択}}", "选择一个背景图像"],
            ["{{カラーポインターを追加}}", "添加颜色指针"],
            ["{{カラー値}}", "颜色"],
            ["{{アルファ(0%-100%)}}", "阿尔法(0%-100%)"],
            ["{{アルファ値}}", "阿尔法"],
            ["{{選択対象の幅}}", "选择对象的宽度"],
            ["{{選択対象のX座標}}", "选择对象的X坐标"],
            ["{{選択対象の高さ}}", "选择对象的高度"],
            ["{{選択対象のY座標}}", "选择对象的Y坐标"],
            ["{{選択対象の幅の伸縮}}", "选定对象的比例X"],
            ["{{選択対象を回転}}", "旋转物体"],
            ["{{選択対象の高さの伸縮}}", "所选对象的比例Y"],
            ["{{アルファオフセット(-255〜255)}}", "阿尔法偏移(-255〜255)"],
            ["{{赤(0%-100%)}}", "红色(0%-100%)"],
            ["{{赤オフセット(-255〜255)}}", "红色偏移(-255〜255)"],
            ["{{緑(0%-100%)}}", "绿色(0%-100%)"],
            ["{{緑オフセット(-255〜255)}}", "绿色抵消(-255〜255)"],
            ["{{青(0%-100%)}}", "蓝色(0%-100%)"],
            ["{{青オフセット(-255〜255)}}", "蓝色偏移(-255〜255)"],
            ["{{ブレンドモード}}", "混合模式"],
            ["{{フィルターを選択}}", "选择一个过滤器"],
            ["{{フィルターを追加}}", "添加一个过滤器"],
            ["{{サウンドを追加}}", "添加一个声音"],
            ["{{フィルターを表示・非表示する}}", "显示和隐藏过滤器"],
            ["{{フィルターを削除}}", "删除过滤器"],
            ["{{水平方向にぼかす}}", "水平方向的模糊"],
            ["{{垂直方向にぼかす}}", "纵向模糊"],
            ["{{フィルター強度}}", "过滤强度"],
            ["{{フィルター角度}}", "过滤角度"],
            ["{{シャドウのアルファ}}", "影子阿尔法"],
            ["{{シャドウのカラー}}", "阴影颜色"],
            ["{{フィルター距離}}", "过滤距离"],
            ["{{ハイライトのカラー}}", "高光色"],
            ["{{ハイライトのアルファ}}", "突出显示阿尔法"],
            ["{{グラデーションカラー}}", "渐变色"],
            ["{{グラデーションのアルファ}}", "梯度阿尔法"],
            ["{{タブの移動・名前を変更}}", "移动/重命名标签"],
            ["{{プロジェクトを閉じる}}", "关闭该项目"],
            ["{{上下に移動}}", "上下移动"],
            ["{{レイヤー変更(ダブルクリック)}}", "改变图层(双击)"],
            ["{{レイヤーをハイライト}}", "高光层"],
            ["{{レイヤーを非表示}}", "隐藏层"],
            ["{{レイヤーをロック}}", "锁定图层"],
            ["{{カーブポインター(ダブルクリックでON/OFF)}}", "曲线指针（双击打开/关闭）"],
            ["{{インスタンス名}}", "Instance Name"],
            ["{{ライブラリ内の検索}}", "在图书馆中搜索"],
            ["{{フレームラベル}}", "框架标签"],
            ["{{プロジェクトが保存されていない場合、このタブのプロジェクトデータを復旧する事はできません。タブを削除しますか？}}", "如果没有保存项目，就不可能在这个标签上恢复项目数据。 你想删除这个标签吗？"]
        ]);
    }
}