/**
 * @class
 * @extends Language
 */
class Chinese extends Language
{
    /**
     * @constructor
     * @public
     */
    constructor()
    {
        super();
    }

    /**
     * @return {Map}
     * @method
     * @public
     */
    createMapping ()
    {
        return new Map([
            ["{{プレビューのON/OFF}}", "预览开/关"],
            ["{{フォント枠サイズ}}", "字体帧大小"],
            ["{{フォント枠カラー}}", "字体帧颜色"],
            ["{{オニオンスキン}}", "洋葱皮"],
            ["{{バケツツール}}", "整体填充工具"],
            ["{{ペンツール}}", "钢笔工具"],
            ["{{ダブルクリックでカーブポイントが追加されます}}", "双击来添加一个曲线点"],
            ["{{選択ツール}}", "选择工具"],
            ["{{Shape変形ツール}}", "形状变换工具"],
            ["{{テキストツール}}", "文本工具"],
            ["{{短形ツール}}", "矩形工具"],
            ["{{楕円ツール}}", "椭圆工具"],
            ["{{角丸矩形ツール}}", "圆角矩形工具"],
            ["{{塗りのカラー}}", "填充颜色"],
            ["{{線のカラー}}", "画笔颜色"],
            ["{{線の太さ}}", "画笔宽度"],
            ["{{プロジェクトデータの読込}}", "载入工程文件"],
            ["{{プロジェクトデータを保存}}", "保存工程文件"],
            ["{{書き出し}}", "导出"],
            ["{{Discordへ移動}}", "前往discord"],
            ["{{バグ報告}}", "错误报告"],
            ["{{設定}}", "设置"],
            ["{{タブを追加}}", "添加标签页"],
            ["{{タブの一覧を表示・移動}}", "标签页列表"],
            ["{{スクリプトを追加}}", "添加一个脚本"],
            ["{{キーフレームを追加}}", "添加一个关键帧"],
            ["{{空のキーフレームを追加}}", "添加一个空的关键帧"],
            ["{{フレームを追加}}", "添加帧"],
            ["{{フレームを削除}}", "删除帧"],
            ["{{再生}}", "播放"],
            ["{{停止}}", "停止"],
            ["{{ループ設定}}", "循环设置"],
            ["{{レイヤーを追加}}", "添加图层"],
            ["{{レイヤーを削除}}", "删除图层"],
            ["{{全てのレイヤーをハイライト}}", "高亮所有图层"],
            ["{{全てのレイヤーを非表示}}", "隐藏所有图层"],
            ["{{全てのレイヤーをロック}}", "锁定所有图层"],
            ["{{比率を固定}}", "锁定比例"],
            ["{{ステージの幅}}", "画面宽度"],
            ["{{背景色}}", "背景颜色"],
            ["{{ステージの高さ}}", "画面高度"],
            ["{{フレームレート}}", "帧速率"],
            ["{{シンボル名}}", "符号名称"],
            ["{{イージング設定}}", "过渡设置"],
            ["{{ビデオの音量設定}}", "视频音量设置"],
            ["{{自動再生}}", "自动播放"],
            ["{{テキストエリアのボーダー設定}}", "文本框边框设置"],
            ["{{テキスト入力設定}}", "文本输入设置"],
            ["{{フォント選択}}", "字体选择"],
            ["{{自動サイズ調整}}", "自动调整尺寸"],
            ["{{フォントスタイルタイプ}}", "字体风格类型"],
            ["{{行揃え}}", "对齐设置"],
            ["{{改行設定}}", "换行设置"],
            ["{{スクロール設定}}", "滚动设置"],
            ["{{フォントサイズ}}", "字体大小"],
            ["{{フォントカラー}}", "字体颜色"],
            ["{{行間}}", "行间距"],
            ["{{文字幅}}", "字符宽度"],
            ["{{左マージン}}", "左边距"],
            ["{{右マージン}}", "右边距"],
            ["{{カラー種別の選択}}", "选择颜色类型"],
            ["{{背景画像の選択}}", "选择背景图片"],
            ["{{カラーポインターを追加}}", "添加颜色指针"],
            ["{{カラー値}}", "颜色"],
            ["{{アルファ(0%-100%)}}", "透明度（0%-100%）"],
            ["{{アルファ値}}", "透明度"],
            ["{{選択対象の幅}}", "选择对象的宽度"],
            ["{{選択対象のX座標}}", "选择对象的X轴坐标"],
            ["{{選択対象の高さ}}", "选择对象的高度"],
            ["{{選択対象のY座標}}", "选择对象的Y轴坐标"],
            ["{{選択対象の幅の伸縮}}", "选定对象的X轴缩放"],
            ["{{選択対象を回転}}", "旋转物体"],
            ["{{選択対象の高さの伸縮}}", "所选对象的比例Y"],
            ["{{アルファオフセット(-255〜255)}}", "透明度偏移（-255~255）"],
            ["{{赤(0%-100%)}}", "红色（0%-100%）"],
            ["{{赤オフセット(-255〜255)}}", "红色偏移（-255~255）"],
            ["{{緑(0%-100%)}}", "绿色（0%-100%）"],
            ["{{緑オフセット(-255〜255)}}", "绿色偏移（-255~255）"],
            ["{{青(0%-100%)}}", "蓝色（0%-100%）"],
            ["{{青オフセット(-255〜255)}}", "蓝色偏移（-255~255）"],
            ["{{ブレンドモード}}", "混合模式"],
            ["{{フィルターを選択}}", "选择滤镜"],
            ["{{フィルターを追加}}", "添加滤镜"],
            ["{{サウンドを追加}}", "添加声音"],
            ["{{フィルターを表示・非表示する}}", "显示和隐藏滤镜"],
            ["{{フィルターを削除}}", "删除滤镜"],
            ["{{水平方向にぼかす}}", "横向模糊"],
            ["{{垂直方向にぼかす}}", "纵向模糊"],
            ["{{フィルター強度}}", "滤镜强度"],
            ["{{フィルター角度}}", "滤镜角度"],
            ["{{シャドウのアルファ}}", "阴影透明度"],
            ["{{シャドウのカラー}}", "阴影颜色"],
            ["{{フィルター距離}}", "滤镜距离"],
            ["{{ハイライトのカラー}}", "高光色"],
            ["{{ハイライトのアルファ}}", "高光透明度"],
            ["{{グラデーションカラー}}", "渐变色"],
            ["{{グラデーションのアルファ}}", "渐变透明度"],
            ["{{タブの移動・名前を変更}}", "移动/重命名标签"],
            ["{{プロジェクトを閉じる}}", "关闭工程"],
            ["{{上下に移動}}", "上下移动"],
            ["{{レイヤー変更(ダブルクリック)}}", "改变图层（双击）"],
            ["{{レイヤーをハイライト}}", "高亮图层"],
            ["{{レイヤーを非表示}}", "隐藏图层"],
            ["{{レイヤーをロック}}", "锁定图层"],
            ["{{カーブポインター(ダブルクリックでON/OFF)}}", "曲线指针（双击打开/关闭）"],
            ["{{インスタンス名}}", "实例名称"],
            ["{{ライブラリ内の検索}}", "在库中搜索"],
            ["{{フレームラベル}}", "帧标签"],
            ["{{プロジェクトが保存されていない場合、このタブのプロジェクトデータを復旧する事はできません。タブを削除しますか？}}", "如果工程没有保存，将无法恢复此标签页数据。 你想删除这个标签页吗？"]
        ]);
    }
}